export const posts = [
  {
    id: "1",
    title: "Первая статья",
    excerpt: "Короткое описание первой статьи.",
    content:
      "Это первая статья. Здесь может быть любой текст. Используем React Router для навигации.",
  },
  {
    id: "2",
    title: "Вторая статья",
    excerpt: "Короткое описание второй статьи.",
    content:
      "Это вторая статья. Демонстрируем useParams для получения id и useNavigate для переходов.",
  },
  {
    id: "3",
    title: "Третья статья",
    excerpt: "Короткое описание третьей статьи.",
    content:
      "Это третья статья. Здесь можно добавить больше текста, чтобы выглядело как блог.",
  },
];
